-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 15, 2023 at 08:10 AM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `roengrang`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `pro_id` int(11) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสสินค้า',
  `shop_id` int(11) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสร้านค้า',
  `cat_id` int(4) UNSIGNED ZEROFILL NOT NULL COMMENT 'รหัสหมวดหมู่',
  `pro_name` varchar(255) NOT NULL COMMENT 'ชื่อสินค้า',
  `pro_price` float(10,2) NOT NULL COMMENT 'ราคา',
  `pro_amount` int(11) NOT NULL COMMENT 'จำนวน',
  `pro_detail` varchar(500) NOT NULL COMMENT 'รายละเอียด',
  `pro_img` varchar(255) NOT NULL COMMENT 'รูปสินค้า',
  `pro_point` int(11) NOT NULL COMMENT 'คะแนนสินค้า',
  `pro_like` int(11) NOT NULL COMMENT 'จำนวนคนชอบ',
  `pro_selled` int(11) NOT NULL COMMENT 'จำนวนขาย',
  `add_date` timestamp NOT NULL DEFAULT current_timestamp() COMMENT 'วันที่เพิ่ม',
  `update_date` timestamp NOT NULL DEFAULT current_timestamp() COMMENT 'เวลาที่อัพเดต',
  `pro_status` int(1) NOT NULL DEFAULT 1 COMMENT 'สถานะสินค้า\r\n0=ระงับ\r\n1=พร้อมขาย\r\n2=ใกล้หมด\r\n3=หมด',
  `pro_send` int(1) NOT NULL COMMENT 'ลักษณะการการส่ง\r\n1=ขายเฉพาะในชุมชน\r\n2=ขายทั้งหมด'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`pro_id`, `shop_id`, `cat_id`, `pro_name`, `pro_price`, `pro_amount`, `pro_detail`, `pro_img`, `pro_point`, `pro_like`, `pro_selled`, `add_date`, `update_date`, `pro_status`, `pro_send`) VALUES
(00000000001, 00000000001, 0001, 'ผ้าไหมเริงราง', 500.00, 10, 'd', 'd9339d6094d84659218c5a8843dc482a.jpg', 5, 0, 3, '2023-01-31 11:16:31', '2023-01-31 11:16:31', 1, 0),
(00000000002, 00000000001, 0001, 'กระเป๋าผ้าไหม', 500.00, 10, 'v', '2eaf8f477a41177d76d0d908073bdea0.jpg', 5, 0, 3, '2023-01-31 11:30:20', '2023-01-31 11:30:20', 1, 2),
(00000000003, 00000000001, 0002, 'น้ำแดงโซดา', 45.00, 10, 'ดดด', '4af31580faab4217825af104e0263cfa.jpg', 5, 0, 2, '2023-01-31 11:40:00', '2023-01-31 11:40:00', 1, 1),
(00000000004, 00000000001, 0001, 'สบู่ลักซ์', 25.00, 10, 'd', '33e3fa18c0fd43f416b981eb840d6a70.jpg', 5, 0, 1, '2023-01-31 11:44:03', '2023-01-31 11:44:03', 1, 1),
(00000000005, 00000000001, 0002, 'ข้าวมันไก่ต้ม', 50.00, 10, 'f', '2ffb80abb1deb20c9af34501ef60b341.jpg', 5, 0, 0, '2023-01-31 11:46:44', '2023-01-31 11:46:44', 1, 1),
(00000000006, 00000000003, 0002, 'ข้าวเสาไห้/เจ๊กเชย ข้าวสาร', 60.00, 5, 'ข้าวเจ๊กเชยเสาไห้ ข้าวพันธุ์พื้นเมืองของ จ.สระบุรีเป็นสินค้าสิ่งบ่งชี้ทางภูมิศาสตร์หรือ GI ปลูกได้ที่ อ.เสาไห้ และบางพื้นที่ใน จ.สระบุรี เท่านั้น คุณสมบัติพิเศษ เป็นข้าวพื้นแข็ง เมื่อหุงสุกข้าวจะร่วนเป็นตัว ไม่เกาะเป็นก้อน หุงขึ้นหม้อ ข้าวสุกจะนุ่มไม่แฉะ ไม่แข็งกระด้าง ไม่เหนียวเละ ไม่ยุบตัวเมื่อเป็นข้าวราดแกง ไม่บูดง่ายเมื่อทิ้งไว้ข้ามวัน ข้าวเก่าเมื่อนำมาหุงไม่มีกลิ่นสาบ มีคุณภาพไม่เปลี่ยนแปลง\r\n\r\nน้ำหนัก : 1 กิโลกรัม', '7deb7a5802adbdda64727cc1ca1df5f9.jpg', 5, 0, 0, '2023-05-05 15:55:16', '2023-05-05 15:55:16', 1, 2),
(00000000007, 00000000003, 0001, 'สบู่ขมิ้นมะหาด', 250.00, 10, '•กระปุกใหญ่ใช้ได้นาน\r\nสรรพคุณและวิธีใช้\r\n- ฟอกหน้า ฟอกตัว ใช้แทนสบู่ และโฟมล้างหน้าทั่วไป\r\n- คุณลักษณะแบบพิเศษของสบู่ที่ทำเป็นเนื้อครีมทำให้สามารถใส่สมุนไพรเป็นส่วนผสมได้มากกว่าสบู่แบบอื่น ใช้แล้วจะสบายตัว ไม่เหนียวเหนอะหนะ คนที่กลิ่นตัวเหม็นกลิ่นเต่าแรงฟอก 3วันหาย\r\n- นำมาใส่ใยบวบเพื่อใช้ขัดผิว ด้วยคุณค่าทางสมุนไพรแบบจัดเต็มเรียกได้ว่ามีส่วนผสมของสมุนไพรถึง 10 ชนิด \r\n- สิวที่เต็มหน้าจะแห้ง ไม่อักเสบ รอยดำจาง\r\n- ใช้ไปสักพัก ฝ้าหาย กระจะจางลง\r\n- คนเหงื่อเนอะ แพ้เหงื่อตัวเอง ใช้ไปเหงื่อจะเบาลง\r\nด้ว', 'c35cb89e93b613810ca11e78de804297.jpg', 5, 0, 0, '2023-05-05 16:00:27', '2023-05-05 16:00:27', 1, 1),
(00000000008, 00000000003, 0002, 'กระยาสาทเจ้แดง', 59.00, 2, 'กระยาสารทอย่างดี สะอาด หอม หวาน มัน กรอบ อร่อย สุดยอดของฝากจากอำเภอเสาไห้ จังหวัดสระบุรี\r\n\r\nน้ำหนัก : 250 กรัม\r\n', '5832c6073c6516ccdd7fcfa9b3312dec.jpg', 5, 0, 0, '2023-05-05 16:03:10', '2023-05-05 16:03:10', 1, 2),
(00000000009, 00000000003, 0002, 'กระเทียมบ่มดำ', 290.00, 8, 'กระเทียมดำ (Black Garic) : ✅กระเทียมดำ มีสารต้านอนุมูลอิสระชื่อ เอส-แอลลีซิสเตอีน (S-allylcysteine: SAC) ที่ไม่สามารถพบได้ในกระเทียมสด สารตัวนี้มีงานวิจัยรองรับมากมายว่าช่วยเรื่องลดความดัน กระตุ้นการสร้างไนตริกออกไซด์ ชะลอวัย เพิ่มความยืดหยุ่นของเส้นเลือด\r\n\r\nน้ำหนัก : 120 กรัม', 'ec283769b8825858b319a43fa2c3ed8b.jpg', 5, 0, 0, '2023-05-05 16:07:06', '2023-05-05 16:07:06', 1, 2),
(00000000010, 00000000003, 0001, 'ดอกไม้ประดิษฐ์', 500.00, 50, 'ดอกไม้ประดิษฐ์ด้วยความปราณีต มีหลายแบบให้เลือก อาทิ ช่อประทาน พวงหรีด ดอกไม้เล็ก\r\n\r\nพวงหรีด 500 บาท\r\nช่อประทาน 25 บาท\r\nดอกเล็ก 1-2 บาท\r\n', 'e92ae672c113aa89b9c59d19efe7dea5.jpg', 5, 0, 0, '2023-05-05 16:10:58', '2023-05-05 16:10:58', 1, 2),
(00000000011, 00000000003, 0001, 'ตะกร้าเชือกมัดฟาง', 800.00, 3, 'ตะกร้าเชือกมัดฟาง ทรงกลม 5สีสดใส ลายพิกุล ใบใหญ่จุใจ ใส่ของได้มากมาย\r\nเส้นผ่านศูนย์กลางฐาน 25 เซนติเมตร\r\nเส้นผ่านศูนย์กลางปาก 30 เซนติเมตร\r\nความสูงไม่รวมหูหิ้ว 18 เซนติเมตร', 'dbe267ac24ccc65fd623c5ad0f95caae.jpg', 5, 0, 0, '2023-05-05 16:18:32', '2023-05-05 16:18:32', 1, 1),
(00000000012, 00000000003, 0001, 'หมวกผ้ามัดย้อม', 150.00, 10, 'หมวกผ้ามัดย้อมคราม \"สีสันแนวสุดเก๋ ใส่เท่ห์ไม่เหมือนใคร\"', '277d0207edff2ba15db51da297b571c7.jpg', 5, 0, 0, '2023-05-05 16:48:38', '2023-05-05 16:48:38', 1, 2),
(00000000013, 00000000003, 0001, 'ผ้าขาวม้า', 160.00, 30, 'ผ้าขาวม้าทอมือหลากสีสันสวยงามให้เลือกซื้อ', '07deeb21e11681e66008a86fdfdd909e.jpg', 5, 0, 0, '2023-05-05 16:53:30', '2023-05-05 16:53:30', 1, 2),
(00000000014, 00000000003, 0001, 'ผ้าคลุมไหล่', 150.00, 20, 'ผ้าทอยกมุก ผ้าคลุมไหล่หลากสีสัน', 'f58e65be5494d98ff2c59c54aade6e12.jpg', 5, 0, 0, '2023-05-05 16:59:20', '2023-05-05 16:59:20', 1, 2),
(00000000015, 00000000003, 0001, 'ผ้าซิ่นไทยวญ', 250.00, 5, 'อนุรักษ์และฟื้นฟู เพื่อสืบสานมรดกไทยวญ ผ้าซิ่นทอมือไทยวญ ลายขวาง ผ้าพื้นถิ่นของท่าช้าง', '8e2d170000c15e2a4be26d490ee3c562.jpg', 5, 0, 0, '2023-05-05 17:01:51', '2023-05-05 17:01:51', 1, 1),
(00000000016, 00000000003, 0001, 'หมอนหนุนใบใหญ่', 50.00, 8, 'หมอนหนุนนอนสบาย ซักง่าย', 'd7c092442bfc86135d78eb531743a053.jpg', 5, 0, 0, '2023-05-05 17:05:36', '2023-05-05 17:05:36', 1, 1),
(00000000017, 00000000003, 0001, 'หมอนหนุนลายสก็อตใบเล็ก', 35.00, 8, 'หมอนหนุนลายสก็อต นอนดีหลับสบาย ผ้าบางเบา ซักง่าย ราคาเพียง35บาท', '9fea1704bfe2f547da2ca5a47d955949.jpg', 5, 0, 0, '2023-05-05 17:07:06', '2023-05-05 17:07:06', 1, 1),
(00000000018, 00000000003, 0001, 'ถุงผ้าใส่แก้วน้ำ', 35.00, 3, 'ถุงใส่แก้วน้ำ สีสันสดใส ลายน่ารัก งานปราณีต งานฝีมือ', '98c5305c4ab76d970fb7303b381a5f94.jpg', 5, 0, 0, '2023-05-05 17:09:25', '2023-05-05 17:09:25', 1, 2),
(00000000019, 00000000003, 0001, 'แชมพูสมุนไพร', 59.00, 3, 'แชมพูสมุนไพร หลากหลายชนิด อาทิเช่น ดอกอัญชัน ว่านห่างจระเข้ น้ำมันมะพร้าว มะกรูด ขิงลดผมร่วง ผมบาง ลดหงอกดกดำ ขจัดรังแค ล้างสารเคมีตกค้าง และกระตุ้นการเกิดผมใหม่\r\n\r\nน้ำหนัก : 200 ml', '6dff11cf95dcdc955436415741706422.jpg', 5, 0, 0, '2023-05-05 17:11:45', '2023-05-05 17:11:45', 1, 2),
(00000000020, 00000000003, 0001, '', 350.00, 6, 'ทุกวันทาได้ตลอดตามต้องการเป็นสมุนไพรธรรมชาติปลอดสารเคมีควรใช้อย่างต่อเนื่องและมีวินัยในการใข้คือต้องอดทนช้า/เร็วเห็นผลตามสภาพผิวหน้า\r\n\r\nน้ำหนัก : 15ml\r\n', '2d3f0d8d16d674e7f6bf079252d46a0f.jpg', 5, 0, 0, '2023-05-05 17:20:23', '2023-05-05 17:20:23', 1, 2),
(00000000021, 00000000003, 0001, 'สบู่CHARCOAL 24k', 150.00, 8, 'สรรพคุณลดสิวทุกชนิด ลดฝ้าจุดด่างดำ หน้าขาวใส ขับสารพิษสารเคมี\r\nสบู่ธรรมชาติปราบสิวเหมาะสำหรับรักษาสิวทุกชนิดปรับสูตรใหม่ผสมทองคำ24k\r\n\r\nน้ำหนัก : 90 กรัม\r\n', '2ee7b0bd9769fd01af1c68dfc02a68f8.jpg', 5, 0, 0, '2023-05-05 17:22:07', '2023-05-05 17:22:07', 1, 2),
(00000000022, 00000000003, 0002, 'ปลาร้าสับ ผู้ว่าชม', 35.00, 10, 'รสดี รสเด็ด ทานกับผักสด อร่อยๆ ปลาร้าสับ สับจิงๆนะ สับมือนะค๊ะ', 'f66752262b9ef6dff2b219c52304f22a.jpg', 5, 0, 0, '2023-05-05 17:23:46', '2023-05-05 17:23:46', 1, 1),
(00000000023, 00000000003, 0002, 'ถั่วกรอบแก้ว', 50.00, 3, 'หวาน มัน อร่อย รับประทานเพลิดเพลิน เป็นของฝาก สุดประทับใจ', 'f041381b21be64ed1a7c284a3f63ed14.png', 5, 0, 0, '2023-05-05 17:27:57', '2023-05-05 17:27:57', 1, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`pro_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `pro_id` int(11) UNSIGNED ZEROFILL NOT NULL AUTO_INCREMENT COMMENT 'รหัสสินค้า', AUTO_INCREMENT=24;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
